## note

In [4]:
import numpy as np
import pandas as pd

In [7]:
data = [1,2,3,4]
series1 = pd.Series(data)
series1

data = [[1,2,3,4],['a','b']]
series1 = pd.Series(data)
print(series1)
print(type(series1))

0    [1, 2, 3, 4]
1          [a, b]
dtype: object
<class 'pandas.core.series.Series'>

In [9]:
data = [1,2,3]
series1 = pd.Series(data, index=['a','b','c'])
print(series1['a':'b'])

a    1
b    2
dtype: int64

In [14]:
data = [[1,2,3,4,5], [1,2,3]]
df = pd.DataFrame(data)
df

   0  1  2    3    4
0  1  2  3  4.0  5.0
1  1  2  3  NaN  NaN

In [15]:
data = pd.Series([6,12], index=['a','b'])
df = pd.DataFrame(data)
df

    0
a   6
b  12

In [16]:
data = np.array([['a','b'], [6,12]])
df = pd.DataFrame( { 'A':data[:,0], 'B':data[:,1] } )
df

   A   B
0  a   b
1  6  12

In [19]:
data = {"a": ['BigBlueberry', 'mango'], "b": [10,12]}
df = pd.DataFrame(data)
df["FruitName"] = df["a"]
df

       a   b FruitName
0  apple  10     apple
1  mango  12     mango

In [36]:
data = [1,2]

df = pd.DataFrame(data)

df.rename(index = {0:"a", 1:"b"}, inplace=True)
df.rename(index = str, columns={0:"A"}, inplace=True)
df.columns=["a"]

df

   a
a  1
b  2

In [42]:

data1 = [["py1","NaN", 8, "NaN", "Game1", "NaN"], ["py2","None", 9, "NaN", "Game2", "NaN"]]

data2 = [["NaN", "py5", "NaN", "Kick", "NaN", "Game5"], ["NaN", "py6", "NaN", "Elbow", "NaN", "Game6"]]

df1 = pd.DataFrame(data1)

df2 = pd.DataFrame(data2)

print(df1)

print(df2)

pd.concat([df1, df2])

     0     1  2    3      4    5
0  py1   NaN  8  NaN  Game1  NaN
1  py2  None  9  NaN  Game2  NaN
     0    1    2      3    4      5
0  NaN  py5  NaN   Kick  NaN  Game5
1  NaN  py6  NaN  Elbow  NaN  Game6

     0     1    2      3      4      5
0  py1   NaN    8    NaN  Game1    NaN
1  py2  None    9    NaN  Game2    NaN
0  NaN   py5  NaN   Kick    NaN  Game5
1  NaN   py6  NaN  Elbow    NaN  Game6

In [58]:
data1 = ({"A":[1,2,3], "B":[4,5,6],"C":[1,2,3], "D":[4,5,6]})
data2 = ({"A":[7,8,9], "C":[1,0,1],"E":[7,8,9], "F":[1,0,1]})
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print(df2)

   A  B  C  D
0  1  4  1  4
1  2  5  2  5
2  3  6  3  6
   A  C  E  F
0  7  1  7  1
1  8  0  8  0
2  9  1  9  1

In [59]:
pd.concat([df1,df2])

   A    B  C    D    E    F
0  1  4.0  1  4.0  NaN  NaN
1  2  5.0  2  5.0  NaN  NaN
2  3  6.0  3  6.0  NaN  NaN
0  7  NaN  1  NaN  7.0  1.0
1  8  NaN  0  NaN  8.0  0.0
2  9  NaN  1  NaN  9.0  1.0

In [60]:
pd.concat([df1, df2], axis=1, join="inner")

   A  B  C  D  A  C  E  F
0  1  4  1  4  7  1  7  1
1  2  5  2  5  8  0  8  0
2  3  6  3  6  9  1  9  1

In [93]:



data1 = ({"key":[1,2,3], "value":[4,5,6]})
data2 = ({"key":[3,8,9], "value":[1,0,1]})

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print(df2)

df1.merge(df2, on='key', how="inner")

   key  value
0    1      4
1    2      5
2    3      6
   key  value
0    3      1
1    8      0
2    9      1

   key  value_x  value_y
0    3        6        1

In [112]:
data1 = ({"A":[1,2,3], "B":[4,5,6]})
data2 = ({"A":[6,8,9], "B":[1,3,1]})
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
print(df1)
print(df2)
pd.merge(df1, df2, on=["B"], how="outer")

   A  B
0  1  4
1  2  5
2  3  6
   A  B
0  6  1
1  8  3
2  9  1

   A_x  B  A_y
0  1.0  4  NaN
1  2.0  5  NaN
2  3.0  6  NaN
3  NaN  1  6.0
4  NaN  1  9.0
5  NaN  3  8.0

In [116]:

data = pd.read_csv('/Users/luo/Documents/code/python3/jupyter/passwd/new/Post3.txt',sep=":", header=None)
data.columns = ["a", "b", "c", "etc."]
data

,a,b,c,etc.
0,zombiesgotmytongue@gmail.com,chuckyp1-----------------Balance,"32.01, Can Withdraw",US$32.01
1,abutler315@gmail.com,annab123-----------------Balance,"2.00, Can Withdraw",US$2.00
2,saum.bhatnagar@gmail.comConfusedenbonzakhura--...,"9.87, Can Withdraw",US$9.87,NaN
3,suchit143@gmail.com,computer0143-----------------Balance,"1300, Can Withdraw","\u20b91,300"
4,diana.kubasova@gmail.com,lacitis3----------Balance,"9.63, Can Withdraw","9,63\u20ac"
5,carwilliamson@gmail.com,tomas1717----------Balance,"10.79, Can Withdraw",US$10.79